{
  "title": "Edu Nievas - Desarrollador Full Stack",
  "header": {
    "iAm": "Soy",
    "developer": "Desarrollador",
    "developerSpan": "Full Stack"
  },
  "contact": "Contacto",
  "projects": {
    "projectsTitle": "Proyectos",
    "online_shop": {
      "title": "Tienda online (DAM)",
      "description": "Tienda online desarrollada en Angular con Firebase; se utilizó TailwindCSS, Bootstrap, entre otros. Esto se realizó durante el primer curso de DAM."
    },
    "primer_portfolio": {
      "title": "Primer portfolio (SMR)",
      "description": "Primer portfolio desarrollado únicamente con HTML y CSS en 2022 durante el segundo curso de Sistemas Microinformáticos y Redes. Dentro de este portfolio se explicó y se mostró la creación de otros pequeños proyectos del curso."
    }
  },
  "showProjects": "Ver proyecto",
  "showRepositories": "Ver repositorio",
  "technologies": {
    "technologiesTitle": "Tecnologías",
    "description": "He trabajado con varias ",
    "span": "tecnologías, lenguajes, librerías y herramientas",
    "descriptionEnd": ", e intento seguir aprendiendo y mejorando cada vez más. También intento aprender nuevas tecnologías y mejorar mis conocimientos."
  },
  "aboutMe": {
    "aboutMeTitle": "Sobre mí",
    "firstPart": "¡Hola! Soy Edu Nievas, aunque la mayoría me conoce como Edu o eduni. Tengo",
    "postAge": "años y actualmente estoy cursando el Grado Superior en Desarrollo de Aplicaciones Multiplataforma (DAM). ",
    "firstSpan": "Mi pasión es el desarrollo web ",
    "firstPartEnd": "y estoy en camino para convertirme en un programador Full Stack.",
    "secondPart": "Me especializo en el desarrollo de aplicaciones web y actualmente ",
    "secondSpan": "busco una empresa donde pueda aplicar mis conocimientos y seguir creciendo profesionalmente. ",
    "secondPartEnd": "En este portafolio, encontrarás ejemplos de mis proyectos y habilidades, que espero sirvan como una muestra de lo que puedo aportar a tu equipo.",
    "thirdPart": "Estoy comprometido a mantenerme al día con las tecnologías del desarrollo web, como ",
    "thirdSpan": "React, Astro y Angular, ampliando constantemente mis conocimientos ",
    "thirdPartEnd": "para adaptarme a los desafíos del sector, si estás buscando un desarrollador motivado y versátil, dispuesto a contribuir a proyectos web innovadores, no dudes en contactarme. ",
    "spanEnd": "¡Estoy aquí para ayudarte!"
  },
  "experience": {
    "navTitle": "Experiencia",
    "title": "Experiencia Laboral",
    "actual": "Actualidad...",
    "mercadona": {
      "date": "Mayo 2022",
      "description": "Trabajando a tiempo parcial mientras estudio DAM, me he enfrentado a un entorno dinámico que requiere una gestión eficaz del tiempo y la priorización de tareas. A través de mis responsabilidades en atención al cliente y reposición de productos, he demostrado cómo puedo:",
      "functions": {
        "adaptQuickly": "Adaptarme rápidamente a cambios, administrando múltiples tareas sin comprometer la calidad del servicio.",
        "teamWork": "Colaborar estrechamente con el equipo para garantizar una experiencia óptima para el cliente, lo que permitide mantener un flujo constante y eficiente en la tienda.",
        "solveProblems": "Resolver problemas de manera eficiente, gestionando inconvenientes como la falta de stock o de personal en la línea de cajas de manera rápida.",
        "organizeTasks": "Priorizar tareas bajo presión."
      }
    },
    "geniusx": {
      "date": "Noviembre 2024 - Abril 2025",
      "description": "Realizando las prácticas de DAM, estoy trabajado directamente en el desarrollo y la mejora de la experiencia digital de los clientes, enfrentándome a desafíos técnicos y creativos que han potenciado mis habilidades para identificar soluciones y optimizar procesos:",
      "functions": {
        "improveSEO": "Desarrollo web y mejora continua: He tomado la iniciativa de optimizar el SEO de las páginas que gestiono, asegurando que los sitios tengan un rendimiento destacado en los motores de búsqueda y sean accesibles para más usuarios.",
        "customFunctionalities": "Implementación de funcionalidades personalizadas en sitios web con Wordpress, adaptándome a las necesidades específicas de cada cliente y utilizando herramientas como HTML5, CSS y JS para dar vida a sus ideas.",
        "problemSolving": "Resolución de problemas técnicos con rapidez, ofreciendo soluciones efectivas para mantener la estabilidad y la funcionalidad de las webs.",
        "teamWork": "Trabajo en equipo en colaboración con diseñadores y desarrolladores, asegurando que cada parte del proyecto se realice de manera alineada y eficiente, lo que contribuye a la calidad final del producto.",
        "adaptability": "Adaptabilidad a diferentes proyectos y estilos, como se ve en la implementación de un diseño innovador para un taller de vehículos, donde tomé una idea base y la transformé en una web funcional con un diseño oscuro y profesional.",
        "n8n": "Automatización con N8N: Implementé flujos automatizados para la empresa utilizando N8N. Entre los flujos que creé se encuentra uno para filtrar facturas y otro para gestionar respuestas automáticas a correos electrónicos, así como la filtración de estos correos. Esto optimiza los procesos internos y mejora la eficiencia operativa."
      }
    },
    "informaticaLlagostera": {
      "date": "Diciembre de 2022 - Junio de 2023",
      "description": "En este puesto, mi rol abarcó tanto aspectos técnicos como la interacción directa con los clientes, lo que me permitió perfeccionar mis habilidades de resolución de problemas y comunicación:",
      "functions": {
        "newTools": "Iniciativa al aprender y aplicar nuevas herramientas de Wordpress por mi cuenta, logrando implementar soluciones que mejoraron la funcionalidad de las webs sin necesidad de supervisión constante.",
        "createDocs": "Creación de documentación técnica clara para los usuarios finales y para el equipo, asegurando que los procedimientos fueran fáciles de seguir y accesibles para todos.",
        "solveProblems": "Resolución de problemas técnicos, como la reparación de equipos y la administración de redes locales, mejorando la infraestructura y reduciendo tiempos de inactividad.",
        "teamWork": "Colaboración eficaz con el equipo de trabajo, lo que resultó en una mejora continua de los servicios y la satisfacción de los clientes."
      }
    }
  },
  "copyright": "Algunos derechos reservados. Inspirado en el portfolio de",
  "english": "Inglés",
  "spanish": "Español"
}