{
  "title": "Edu Nievas - Desarrollador Full Stack",
  "header": {
    "iAm": "Soy",
    "developer": "Desarrollador",
    "developerSpan": "Full Stack"
  },
  "contact": "Contacto",
  "projects": {
    "projectsTitle": "Proyectos",
    "online_shop": {
      "title": "Tienda online (DAM)",
      "description": "Tienda online desarrollada en Angular con Firebase; se utilizó TailwindCSS, Bootstrap, entre otros. Esto se realizó durante el primer curso de DAM."
    },
    "primer_portfolio": {
      "title": "Primer portfolio (SMR)",
      "description": "Primer portfolio desarrollado únicamente con HTML y CSS en 2022 durante el segundo curso de Sistemas Microinformáticos y Redes. Dentro de este portfolio se explicó y se mostró la creación de otros pequeños proyectos del curso."
    }
  },
  "showProjects": "Ver proyecto",
  "showRepositories": "Ver repositorio",
  "technologies": {
    "technologiesTitle": "Tecnologías",
    "description": "He trabajado con varias ",
    "span": "tecnologías, lenguajes, librerías y herramientas",
    "descriptionEnd": ", e intento seguir aprendiendo y mejorando cada vez más. También intento aprender nuevas tecnologías y mejorar mis conocimientos."
  },
  "aboutMe": {
    "aboutMeTitle": "Sobre mí",
    "firstPart": "¡Hola! Soy Edu Nievas, aunque la mayoría me conoce como Edu o eduni. Tengo",
    "postAge": "años y actualmente estoy cursando el Grado Superior en Desarrollo de Aplicaciones Multiplataforma (DAM). ",
    "firstSpan": "Mi pasión es el desarrollo web ",
    "firstPartEnd": "y estoy en camino para convertirme en un programador Full Stack.",
    "secondPart": "Me especializo en el desarrollo de aplicaciones web y actualmente ",
    "secondSpan": "busco una empresa donde pueda aplicar mis conocimientos y seguir creciendo profesionalmente. ",
    "secondPartEnd": "En este portafolio, encontrarás ejemplos de mis proyectos y habilidades, que espero sirvan como una muestra de lo que puedo aportar a tu equipo.",
    "thirdPart": "Estoy comprometido a mantenerme al día con las tecnologías del desarrollo web, como ",
    "thirdSpan": "React, Astro y Angular, ampliando constantemente mis conocimientos ",
    "thirdPartEnd": "para adaptarme a los desafíos del sector, si estás buscando un desarrollador motivado y versátil, dispuesto a contribuir a proyectos web innovadores, no dudes en contactarme. ",
    "spanEnd": "¡Estoy aquí para ayudarte!"
  },
  "experience": {
    "navTitle": "Experiencia",
    "title": "Experiencia Laboral",
    "actual": "Actualidad...",
    "mercadona": {
      "date": "Mayo 2022",
      "description": "Trabajando a tiempo parcial mientras estudio DAM, me he enfrentado a un entorno dinámico que requiere una gestión eficaz del tiempo y la priorización de tareas. A través de mis responsabilidades en atención al cliente y reposición de productos, he demostrado cómo puedo:",
      "functions": {
        "adaptQuickly": "Adaptarme rápidamente a cambios, administrando múltiples tareas sin comprometer la calidad del servicio.",
        "teamWork": "Colaborar estrechamente con el equipo para garantizar una experiencia óptima para el cliente, lo que permitide mantener un flujo constante y eficiente en la tienda.",
        "solveProblems": "Resolver problemas de manera eficiente, gestionando inconvenientes como la falta de stock o de personal en la línea de cajas de manera rápida.",
        "organizeTasks": "Priorizar tareas bajo presión."
      }
    },
    "geniusx": {
      "date": "Noviembre 2024 - Abril 2025",
      "description": "Durante mis prácticas de DAM, trabajé directamente en el desarrollo y la mejora de la experiencia digital de los clientes, afrontando desafíos técnicos y creativos que potenciaron mis habilidades para identificar soluciones y optimizar procesos:",
      "functions": {
        "improveSEO": "Desarrollo web y mejora continua: tomé la iniciativa de optimizar el SEO de las páginas que gestioné, asegurando que los sitios obtuvieran un rendimiento destacado en los motores de búsqueda y fueran accesibles para más usuarios.",
        "customFunctionalities": "Implementación de funcionalidades personalizadas en sitios web con WordPress: me adapté a las necesidades específicas de cada cliente y utilicé herramientas como HTML5, CSS y JS para dar vida a sus ideas.",
        "problemSolving": "Resolución de problemas técnicos con rapidez: ofrecí soluciones efectivas para mantener la estabilidad y funcionalidad de las webs.",
        "teamWork": "Trabajo en equipo en colaboración con diseñadores y desarrolladores: coordiné cada fase del proyecto para asegurar una ejecución alineada y eficiente, contribuyendo a la calidad final del producto.",
        "adaptability": "Adaptabilidad a diferentes proyectos y estilos: implementé un diseño innovador para un taller de vehículos, partiendo de una idea base y transformándola en una web funcional con un estilo oscuro y profesional.",
        "n8n": "Automatización con N8N: implementé flujos automatizados para la empresa utilizando N8N. Creé procesos para filtrar facturas y gestionar respuestas automáticas y filtraje de correos, optimizando los procesos internos y mejorando la eficiencia operativa."
      }
    },
    "informaticaLlagostera": {
      "date": "Diciembre de 2022 - Junio de 2023",
      "description": "En este puesto, mi rol abarcó tanto aspectos técnicos como la interacción directa con los clientes, lo que me permitió perfeccionar mis habilidades de resolución de problemas y comunicación:",
      "functions": {
        "newTools": "Iniciativa al aprender y aplicar nuevas herramientas de Wordpress por mi cuenta, logrando implementar soluciones que mejoraron la funcionalidad de las webs sin necesidad de supervisión constante.",
        "createDocs": "Creación de documentación técnica clara para los usuarios finales y para el equipo, asegurando que los procedimientos fueran fáciles de seguir y accesibles para todos.",
        "solveProblems": "Resolución de problemas técnicos, como la reparación de equipos y la administración de redes locales, mejorando la infraestructura y reduciendo tiempos de inactividad.",
        "teamWork": "Colaboración eficaz con el equipo de trabajo, lo que resultó en una mejora continua de los servicios y la satisfacción de los clientes."
      }
    }
  },
  "personalProjects": {
    "personalProjectsTitle": "Proyectos personales",
    "description": "En los últimos años he liderado y colaborado en la creación y gestión de servidores de GTA V Roleplay en FiveM y de Minecraft, poniendo en práctica la programación, la coordinación de equipos y la atención a la comunidad. Entre los proyectos más destacados se encuentran:",
    "projects": {
      "quanticDreams": {
        "date": "Enero 2020 - Abril 2020",
        "description": " También participé como staff y colaborador en el desarrollo de Quantic Dreams, un servidor de Minecraft. Este servidor contaba con un modo survival y una zona de parcelas con sus respectivos comandos y funciones, además de un modo Skywars. Mi rol incluyó el diseño y la implementación de varias funciones dentro del servidor, así como la moderación y atención a la comunidad. El proyecto, que se inició en enero de 2020, cerró en abril del mismo año debido a la falta de tiempo y recursos. Sin embargo, la experiencia me permitió mejorar en desarrollo de servidores y gestión de comunidades."
      },
      "emeraldCityRP": {
        "date": "Abril 2020 - Julio 2020",
        "description": "Formé parte del equipo de staff de Emerald City RP, un servidor de GTA V Roleplay, desde sus inicios. A pesar de tener solo 16 años en ese momento, asumí varias responsabilidades dentro del servidor. Estuve a cargo de la creación de carteles, redacción de normativas y, sobre todo, desempeñé funciones como staff al atender reportes de jugadores y gestionar tickets en Discord. Mi trabajo fue fundamental para mantener la comunidad organizada y asegurarme de que las reglas se cumplieran, lo que me permitió desarrollar habilidades en gestión de conflictos y atención al cliente. El servidor cerró por decisión del fundador, un conocido mío, pero durante su tiempo activo logré contribuir significativamente a su funcionamiento."
      },
      "renacidosRP": {
        "date": "Marzo 2021 - Agosto 2021",
        "description": "Como fundador y principal programador, fui responsable de la creación y personalización de scripts, mapeados y sistemas del servidor. Mi rol no solo abarcó la parte técnica, sino también la gestión del equipo y la comunidad. Supervisé la implementación de normativas internas, la gestión de roles y facciones, y me encargué de la resolución de problemas técnicos de los jugadores. Durante este proceso, aprendí a tomar decisiones críticas sobre sanciones y resoluciones de conflictos entre usuarios, asegurando que todos los jugadores tuvieran una experiencia justa y agradable.",
        "functions": {
          "coordinateTeam": "Coordinar a un equipo diverso y gestionar sus tareas diarias fue esencial para garantizar que el servidor funcionara correctamente. Aprendí a delegar responsabilidades, priorizar tareas y asegurarme de que el equipo cumpliera con sus objetivos a tiempo.",
          "usersCommunication": "A lo largo de este proyecto, gestioné la comunicación con usuarios que requerían ayuda técnica o reportaban problemas, lo que me permitió practicar la escucha activa y responder de forma clara y eficaz a sus inquietudes.",
          "managementAndProgramming": "Gestioné y programé funciones complejas que permitieron que el servidor alcanzara una media de 40 jugadores simultáneos.",
          "supervision": "Supervisé la creación de contenido original y la traducción de scripts para adaptarlos a la visión del servidor.",
          "decisions": "Tomé decisiones críticas relacionadas con sanciones y resolución de conflictos entre usuarios.",
          "documentation": "Implementé documentación detallada, incluyendo normativas del servidor, reglas de comportamiento y guías de funcionamiento interno."
        }
      },
      "projectW": {
        "date": "Agosto 2024 - Noviembre 2024",
        "description": "En este servidor, asumí el rol de programador principal y jefe de staff, donde me encargué de la actualización y mantenimiento del servidor, añadiendo nuevas funciones y solucionando incidencias. Durante la gestión de este proyecto, mi equipo y yo enfrentamos desafíos como la protección ante ataques DoS, para los cuales tuvimos que investigar y aplicar medidas de seguridad para garantizar la estabilidad del servidor. Aunque las limitaciones de tiempo debido a estudios y otros compromisos nos afectaron, logré mantener el funcionamiento del servidor, al mismo tiempo que coordinaba las tareas de mi equipo y aseguraba que todos los aspectos operativos se cumplieran.",
        "functions": {
          "timeManagement": "La gestión del tiempo fue clave, ya que equilibré mis estudios, trabajo en el servidor y responsabilidades del equipo. Aunque el proyecto no alcanzó el nivel de éxito esperado, me permitió poner en práctica la priorización de tareas y la toma de decisiones bajo presión.",
          "problemSolving": "En cuanto a la resolución de problemas, enfrenté y solucioné múltiples incidencias técnicas que surgieron tanto en la programación como en la protección del servidor. Aprendí a diagnosticar y actuar de manera rápida para solucionar los problemas y evitar que afectaran la experiencia de los usuarios.",
          "updates": "Implementación de actualizaciones frecuentes y adiciones al servidor, mejorando la experiencia del usuario.",
          "managementStaffTeam": "Gestión de un equipo de staff, organizando funciones y tareas para asegurar el buen funcionamiento del servidor.",
          "website": "Diseño y mantenimiento de la página web del servidor, utilizando Astro, donde se detallaban las normativas y reglas del servidor, demostrando mi habilidad para combinar la programación con la creación de contenido web.",
          "clientAttention": "Supervisión de la atención al cliente, resolviendo problemas técnicos y organizando el sistema de sanciones."
        }
      }
    },
    "learnings": "A lo largo de estos proyectos, la atención al cliente fue una prioridad. Estuve en contacto constante con los usuarios, gestionando reportes de bugs, problemas en el rol o incidentes dentro del servidor. Esto me permitió perfeccionar mi habilidad para explicar problemas complejos de forma sencilla, asegurando que los usuarios comprendieran las soluciones y se sintieran escuchados y apoyados. Esta interacción constante también me dio una visión profunda sobre la importancia de la comunicación clara y efectiva, tanto dentro del equipo como con la comunidad de jugadores."
  },
  "copyright": "Algunos derechos reservados. Inspirado en el portfolio de",
  "english": "Inglés",
  "spanish": "Español"
}