{
  "title": "Edu Nievas - Full Stack Developer",
  "header": {
    "iAm": "I am",
    "developer": "Full Stack",
    "developerSpan": "Developer"
  },
  "contact": "Contact",
  "projects": {
    "projectsTitle": "Projects",
    "online_shop": {
      "title": "Online shop (DAM)",
      "description": "Online store developed with Angular and Firebase, using TailwindCSS, Bootstrap, and other tools. This was created during the first year of the DAM course."
    },
    "primer_portfolio": {
      "title": "First portfolio (SMR)",
      "description": "The first portfolio was developed solely with HTML and CSS in 2022, during the second year of the Microcomputer Systems and Networks program. This portfolio showcased and explained the creation of other small projects completed during the course."
    }
  },
  "showProjects": "Show project",
  "showRepositories": "Show repository",
  "technologies": {
    "technologiesTitle": "Technologies",
    "description": "I have worked with various ",
    "span": "technologies, languages, libraries and tools",
    "descriptionEnd": ", and I strive to keep learning and improving constantly. I also aim to learn new technologies and deepen my knowledge further."
  },
  "aboutMe": {
    "aboutMeTitle": "About Me",
    "firstPart": "Hi! I'm Edu Nievas, even though most people know me as Edu or eduni. I'm",
    "postAge": "years old, and I'm currently studying for a Higher Degree in Multiplatform Application Development (DAM). ",
    "firstSpan": "My passion is web development ",
    "firstPartEnd": "and I'm on my way to becoming a Full Stack developer.",
    "secondPart": "I specialize in web application development, and currently ",
    "secondSpan": " looking for a company where I can apply my knowledge and continue to grow professionally. ",
    "secondPartEnd": "In this portfolio, you will find examples of my projects and skills, which I hope will serve as a showcase of what I can contribute to your team.",
    "thirdPart": "I am committed to staying up to date with web development technologies, such as ",
    "thirdSpan": "React, Astro, and Angular, constantly expanding my knowledge ",
    "thirdPartEnd": "to adapt to the challenges of the industry. If you're looking for a motivated and versatile developer, ready to contribute to innovative web projects, feel free to contact me. ",
    "spanEnd": "I’m here to help!"
  },
  "experience": {
    "navTitle": "Experience",
    "title": "Laboral Experience",
    "actual": "Currently...",
    "mercadona": {
      "date": "May 2022",
      "description": "Working part-time while completing my studies (DAM).",
      "functions": {
        "adaptQuickly": "Adapt quickly to changes in demand, handling multiple tasks without compromising service quality.",
        "teamWork": "Collaborate closely with the team to ensure an optimal customer experience, which has allowed me to maintain a smooth and efficient workflow in the store.",
        "solveProblems": "Solve problems efficiently, managing issues such as stock shortages or cash register adjustments quickly and without disrupting daily operations.",
        "organizeTasks": "Organize and prioritize tasks under pressure, ensuring inventory is well-kept and the process runs smoothly without delays."
      }
    },
    "geniusx": {
      "date": "October 2024 - April 2025",
      "description": "During my DAM internship, I've worked directly on developing and enhancing the digital experience for clients, facing technical and creative challenges that have strengthened my ability to identify solutions and optimize processes:",
      "functions": {
        "improveSEO": "Web development and continuous improvement: Took the initiative to optimize SEO for the websites I manage, ensuring that the sites perform well on search engines and are accessible to more users.",
        "customFunctionalities": "Implemented custom functionalities on Wordpress sites, adapting to each client's specific needs and using tools like HTML5, CSS, and JS to bring their ideas to life.",
        "problemSolving": "Problem-solving skills in a quick and efficient manner, providing effective solutions to maintain the stability and functionality of the websites.",
        "teamWork": "Teamwork in collaboration with designers and developers, ensuring that each part of the project aligns and is executed efficiently, contributing to the final product's quality.",
        "adaptability": "Adaptability to different projects and styles, as seen in the implementation of an innovative design for a vehicle workshop, where I took an initial concept and transformed it into a functional website with a sleek dark design.",
        "n8n": "Automation with N8N: I implemented automated workflows for the company using N8N. Among the workflows I created is one for filtering invoices and another for managing automatic email responses, as well as filtering these emails. This optimizes internal processes and improves operational efficiency."
      }
    },
    "informaticaLlagostera": {
      "date": "December 2022 - June 2023",
      "description": "In this role, I covered both technical aspects and direct client interaction, which allowed me to enhance my problem-solving and communication skills:",
      "functions": {
        "newTools": "Initiative in learning and applying new Wordpress tools independently, successfully implementing solutions that improved website functionality without constant supervision.",
        "createDocs": "Created clear technical documentation for end users and the internal team, ensuring procedures were easy to follow and accessible to everyone.",
        "solveProblems": "Problem-solving skills in fixing technical issues, such as repairing equipment and managing local networks, improving the infrastructure and reducing downtime.",
        "teamWork": "Collaborated effectively with the team, leading to continuous improvements in services and client satisfaction."
      }
    }
  },
  "copyright": "Some rights reserved. Inspired by the portfolio of",
  "english": "English",
  "spanish": "Spanish"
}